tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/fsl_trdc.h
/*!
 * @brief Enables the update of the selected domains.
 *
 * After the domains' update are enabled, their regions' NSE bits can be set or clear.
 *
 * @param base TRDC peripheral base address.
 * @param mrcIdx MRC index.
 * @param domainMask Bit mask of the domains to be enabled.
 * @param enable True to enable, false to disable.
 */
void TRDC_MrcEnableDomainNseUpdate(TRDC_Type *base, uint8_t mrcIdx, uint16_t domainMask, bool enable);

/*!
 * @brief Sets the NSE bits of the selected regions for domains.
 *
 * This function sets the NSE bits for the selected regions for the domains whose update are enabled.
 *
 * @param base TRDC peripheral base address.
 * @param mrcIdx MRC index.
 * @param regionMask Bit mask of the regions whose NSE bits to set.
 */
void TRDC_MrcRegionNseSet(TRDC_Type *base, uint8_t mrcIdx, uint16_t regionMask);

/*!
 * @brief Clears the NSE bits of the selected regions for domains.
 *
 * This function clears the NSE bits for the selected regions for the domains whose update are enabled.
 *
 * @param base TRDC peripheral base address.
 * @param mrcIdx MRC index.
 * @param regionMask Bit mask of the regions whose NSE bits to clear.
 */
void TRDC_MrcRegionNseClear(TRDC_Type *base, uint8_t mrcIdx, uint16_t regionMask);

/*!
 * @brief Clears the NSE bits for all the regions of the selected domains.
 *
 * This function clears the NSE bits for all regions of selected domains whose update are enabled.
 *
 * @param base TRDC peripheral base address.
 * @param mrcIdx MRC index.
 * @param domainMask Bit mask of the domains whose NSE bits to clear.
 */
void TRDC_MrcDomainNseClear(TRDC_Type *base, uint8_t mrcIdx, uint16_t domainMask);

/*!
 * @brief Sets the configuration for one of the region descriptor per domain per MRC instnce.
 *
 * This function sets the configuration for one of the region descriptor, including the start
 * and end address of the region, memory access control policy and valid.
 *
 * @param base TRDC peripheral base address.
 * @param config Pointer to region descriptor configuration structure.
 */
void TRDC_MrcSetRegionDescriptorConfig(TRDC_Type *base, const trdc_mrc_region_descriptor_config_t *config);
/*! @} */

/*!
 * @name MBC configuration
 * @{
 */
/*!
 * @brief Sets the TRDC MBC(Memory Block Checkers) global valid.
 *
 * Once enabled, it will remain enabled until next reset.
 *
 * @param base TRDC peripheral base address.
 */
static inline void TRDC_SetMbcGlobalValid(TRDC_Type *base)
{
    base->TRDC_CR |= TRDC_TRDC_CR_GVLDB_MASK;
}

/*!
 * @brief Gets the hardware configuration of the one of two slave memories within each MBC(memory block checker).
 *
 * @param base TRDC peripheral base address.
 * @param config Pointer to the structure to get the configuration.
 * @param mbcIdx MBC number.
 * @param slvIdx Slave number.
 */
void TRDC_GetMbcHardwareConfig(TRDC_Type *base,
                               trdc_slave_memory_hardware_config_t *config,
                               uint8_t mbcIdx,
                               uint8_t slvIdx);

/*!
 * @brief Sets the NSR update configuration for one of the MBC instance.
 *
 * After set the NSE configuration, the configured memory area can be updateby NSE set/clear.
 *
 * @param base TRDC peripheral base address.
 * @param config Pointer to NSE update configuration structure.
 * @param mbcIdx MBC index.
 */
void TRDC_MbcSetNseUpdateConfig(TRDC_Type *base, const trdc_mbc_nse_update_config_t *config, uint8_t mbcIdx);

/*!
 * @brief Sets the NSE bits of the selected configuration words according to NSE update configuration.
 *
 * This function sets the NSE bits of the word for the configured regio, memory.
 *
 * @param base TRDC peripheral base address.
 * @param mbcIdx MBC index.
 * @param bitMask Mask of the bits whose NSE bits to set.
 */
void TRDC_MbcWordNseSet(TRDC_Type *base, uint8_t mbcIdx, uint32_t bitMask);

/*!
 * @brief Clears the NSE bits of the selected configuration words according to NSE update configuration.
 *
 * This function sets the NSE bits of the word for the configured regio, memory.
 *
 * @param base TRDC peripheral base address.
 * @param mbcIdx MBC index.
 * @param bitMask Mask of the bits whose NSE bits to clear.
 */
void TRDC_MbcWordNseClear(TRDC_Type *base, uint8_t mbcIdx, uint32_t bitMask);

/*!
 * @brief Clears all configuration words' NSE bits of the selected domain and memory.
 *
 * @param base TRDC peripheral base address.
 * @param mbcIdx MBC index.
 * @param domainMask Mask of the domains whose NSE bits to clear, 0b110 means clear domain 1&2.
 * @param slaveMask Mask of the slaves whose NSE bits to clear, 0x11 means clear all slave 0&1's NSE bits.
 */
void TRDC_MbcNseClearAll(TRDC_Type *base, uint8_t mbcIdx, uint16_t domainMask, uint8_t slaveMask);

/*!
 * @brief Sets the memory access configuration for one of the region descriptor of one MBC.
 *
 * Example: Enable the secure operations and lock the configuration for MRC0 region 1.
 *
 * @code
 * trdc_memory_access_control_config_t config;
 *
 * config.securePrivX = true;
 * config.securePrivW = true;
 * config.securePrivR = true;
 * config.lock = true;
 * TRDC_SetMbcMemoryAccess(TRDC, &config, 0, 1);
 * @endcode
 *
 * @param base TRDC peripheral base address.
 * @param config Pointer to the configuration structure.
 * @param mbcIdx MBC index.
 * @param rgdIdx Region descriptor number.
 */
void TRDC_MbcSetMemoryAccessConfig(TRDC_Type *base,
                                   const trdc_memory_access_control_config_t *config,
                                   uint8_t mbcIdx,
                                   uint8_t rgdIdx);

/*!
 * @brief Sets the configuration for one of the memory block per domain per MBC instnce.
 *
 * This function sets the configuration for one of the memory block, including the memory access
 * control policy and nse enable.
 *
 * @param base TRDC peripheral base address.
 * @param config Pointer to memory block configuration structure.
 */
void TRDC_MbcSetMemoryBlockConfig(TRDC_Type *base, const trdc_mbc_memory_block_config_t *config);
/*! @} */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */

#endif /* FSL_TRDC_H_ */
